import { Table } from "react-bootstrap";
import style from "../../../../high_potential_products_screen.module.scss";

export const StrengthsOpportunitiesAndRecommendations = () => {
  return (
    <div className={`${style.paragraph}`}>
      <h2 className={`lh-lg pb-2 ${style.bold_text}`}>
        ឃ. ការវិភាគចំណុចខ្លាំង ឱកាស និងអនុសាសន៍<sup>៤</sup>
      </h2>

      <Table striped bordered responsive>
        <thead className="text-center lh-lg">
          <tr>
            <th>
              <h3 className={` ${style.bold_smaller_text}`}>ចំណុចខ្លាំង</h3>
            </th>
            <th>
              <h3 className={`${style.bold_smaller_text}`}>ឱកាស</h3>
            </th>
          </tr>
        </thead>
        <tbody className="lh-lg">
          <tr>
            <td>
              <li>និន្នាការនាំចេញមានការកើនឡើងជាលំដាប់</li>
              <li>មានតម្រូវការទីផ្សារខ្ពស់ទាំងក្នុង និងក្រៅប្រទេស</li>
              <li>អាកាសធាតុ និងកត្តាដីកម្ពុជា មានលក្ខណៈអំណោយផលដល់ការដាំដុះ</li>
              <li>ផ្ទៃដីដាំដុះនៅមានចំនួនច្រើន</li>
              <li>ការដាំដុះមានការកើនឡើង និងស្ទើរគ្រប់ខេត្ត</li>
              <li>
                ក្រសួងពាណិជ្ជកម្មកំពុងចងក្រងគោលនយោបាយជាតិស្តីពីគ្រាប់ស្វាយចន្ទី
                ២០២២-២០២៧
              </li>
            </td>
            <td>
              <li>ទីផ្សារចិនឈរនៅលំដាប់ទី១ ក្នុងការនាំចូលពីកម្ពុជា</li>
              <li>
                ការនាំចេញកសិផលកម្ពុជា ភាគច្រើនទទួលបានការ អនុគ្រោះកូតា
                និងពន្ធពីប្រទេសដៃគូ
              </li>
              <li>កិច្ចព្រមព្រៀងពាណិជ្ជកម្មសេរីទ្វេភាគីកម្ពុជា-ចិន</li>
              <li>
                ជំរុញការដាំដុះជាបណ្តុំសហគមន៍ និងប្រែក្លាយជាតំបន់កសិ-ទេសចរណ៍
              </li>
            </td>
          </tr>
        </tbody>
      </Table>

      <h3 className={` lh-lg pt-2 ${style.bold_smaller_text}`}>អនុសាសន៍</h3>

      <ul className="lh-lg">
        <li>ជំរុញការអនុវត្តគោលនយោបាយអភិវឌ្ឍន៍កសិកម្ម ២០១៩-២០២៣</li>
        <li>បង្កើនការចរចា SPS ជាមួយប្រទេសនាំចូល</li>
        <li>ពង្រឹងវិធានការនានា ដើម្បីសម្រួលពាណិជ្ជកម្ម និងជំរុញការនាំចេញ</li>
        <li>
          ពង្រីកផលិតកម្មក្នុងស្រុក ដើម្បីឆ្លើយតបតាមតម្រូវការទីផ្សារក្នុងស្រុក
          និងទីផ្សារក្រៅប្រទេស
        </li>
        <li>អនុវត្តគោលការណ៍ GAP</li>
        <li>
          ជំរុញការផលិតឲ្យមានអនាម័យ គុណភាព សុវត្ថិភាព តាមលក្ខណៈស្តង់ដារអន្តរជាតិ
          ស្របតាមតម្រូវការទីផ្សារ តម្លៃអាចប្រកួតប្រជែង
        </li>
        <li>កសាងហេដ្ឋារចនាសម្ព័ន្ធផ្លូវជនបទ</li>
        <li>លើកទឹកចិត្តដល់វិនិយោគិនឲ្យបង្កើតរោងចក្រកែច្នៃ</li>
        <li>បង្កើត និងរៀបចំសមាគមគ្រាប់ស្វាយចន្ទី</li>
        <li>បង្កើតបណ្តាញខ្សែច្រវាក់តម្លៃ</li>
        <li>បង្កើតម៉ាកសញ្ញា branding and trademark</li>
        <li>
          ភស្តុភារកម្ម (យល់ដឹងអំពីបច្ចេកទេសក្នុងការដឹកជញ្ជូន ការស្តុកទុក។ល។)
        </li>
        <li>ជំរុញការផ្សព្វផ្សាយពាណិជ្ជកម្ម។</li>
      </ul>
      <hr />
      <div className="lh-lg">
        <p>
          <strong>ប្រភព៖</strong>
        </p>
        <sup>៤</sup>
        ក្រសួងពាណិជ្ជកម្ម (២០២៣)
        ផែនការយុទ្ធសាស្ត្រទាញយកប្រយោជន៍ជាអតិបរិមាពីការអនុវត្តកិច្ចព្រមព្រៀងពាណិជ្ជកម្មសេរី,
        ទំព័រ ៨៤-៨៥ <br />
      </div>
    </div>
  );
};
